//条件操作符、原码、反码、补码
#include<stdio.h>

int main()
{
    //条件操作符（三目操作符）（exp1 ? exp2 : exp3）
    int a = 10;
    int b = 20;
    int max = 0;
    max = (a > b ? a : b);//a > b 为真则运行a，为假则运行b 
    
    return 0;
}


//只要是整数，内存中储存的都是二进制的补码
//正数---原码、反码、补码相同
//负数：
//原码------------------>反码-------------------->补码
//直接按照正负         原码的符号位不变           反码 （+1）          
//写出的二进制序列     其他位按位取反得到
//-2
//10000000000000000000000000000010 --原码
//11111111111111111111111111111101 --反码
//11111111111111111111111111111110 --补码