//for循环
#include<stdio.h>

int main()
{
    for (int i = 1; i < 11; i++)
    {
        if (i == 5)
        {
            continue;
        }
        
        printf("%d", i);
    }
    printf("\n");
    printf("===========================================\n");
    int arr[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int a = 0;
    for ( a = 0; a < 10; a++)
    {
        printf("%d", arr[a]);
    }
    printf("\n");
    printf("===========================================\n");
    // for (;;)   ==>判断部分如果被省略,那判断的条件就:恒为正，进入死循环
    //                       如果为0，判断的条件为假，不进入循环
    // {
    //     printf("hehe");
    // }
    int b = 0;
    int c = 0;
    //10 * 10 = 100
    for (b = 0; b < 10; b++)
    {
        for (c = 0; c < 10; c++)
        {
            printf("a");
        }
        
    }
    printf("\n");
    printf("===========================================\n");
    b = 0;
    c = 0;
    //10 * 1 = 10
    for (; b < 10; b++)
    {
        for (; c < 10; c++)//这里c达成一轮循环后值就为10，没有0赋值给他
        {
            printf("a");
        }
        
    }
    printf("===========================================\n");
    int x, y;
    for (x =0, y = 0; x < 2 && y <5; ++x, y++)
    {
        printf("hehe\n");
    }
    

    return 0;
}