/*
操作符分类：
算数操作符
移位操作符(不支持移动负数位和浮点数)
位操作符
赋值操作符
单目操作符
关系操作符
逻辑操作符
条件操作符（三目操作符）
逗号操作符
下标引用、函数调用和结构成员(调用函数的时候的（）就是函数调用操作符)
*/
#include<stdio.h>

int main()
{
    //除了 % 操作符之外，其他的几个操作符都可以作用于整数和浮点数，%操作符的两个操作数必须是整数
    int a = 5 / 2;      //商2余1
    printf("a = %d\n", a);
    double b = 5 / 2.0;      //要想打印小数必须保证除数或被除数至少有一个是小数
    printf("b = %lf\n", b);
    printf("------------------------------------------------------------\n");
    //右移操作符：1.算术右移：右边丢弃，左边补原符号位（0是正，1是负）
    //            2.逻辑右移：右边丢弃，左边补0
    a = -1;
    //  >> --右移操作符
    //移动的是二进制位
    int c = a >> 1;     
    printf("c = %d\n", c);
    //整数的二进制表示有：原码、反码、补码
    //储存到内存的是补码
    //10000000000000000000000000000001 -原码(-1)
    //11111111111111111111111111111110 - 反码(-1)  原码的符号位不变其他全部取反
    //11111111111111111111111111111111 - 补码(-1)  反码+1
    a = -1;
    // << --左移操作符（左边丢弃，右边补0）
    c = a << 1;
    printf("c = %d\n", c);      //每移一位乘个2
    printf("------------------------------------------------------------\n");
    //& - 按二进制位与
    a = 3;
    c = 5;
    int d = a & c;
    //0000000000000000000000000000011
    //0000000000000000000000000000101
    //0000000000000000000000000000001
    printf("d = %d\n", d);
    //| - 按二进制位或
    d = a | c;
    printf("d = %d\n", d);
    //0000000000000000000000000000011
    //0000000000000000000000000000101
    //0000000000000000000000000000111
    //^ - 按二进制位异或
    //对应二进制位相同为0，相异为1
    d = a ^ c;
    printf("d = %d\n", d);
    //0000000000000000000000000000011
    //0000000000000000000000000000101
    //0000000000000000000000000000110
    //统计num的补码中有几个1
    int num = 0;
    printf("num = ");
    scanf("%d", &num);
    int num1 = num;
    int count = 0;
    while (num1)
    {
        if (num1 % 2 == 1)
        {
            count++;
        }
        num1 = num1 / 2;
    }
    printf("count1 = %d\n", count);
    count = 0;
    int num2 = num;
    for (int i = 0; i < 32; i++)
    {
        if (1 == ((num2 >> i) & 1))
        {
            count++;
        }
        
    }
    printf("count2 = %d\n", count);
    return 0;
}