#include<stdio.h>

int main()
{
    int a = 0;
    //~按二进制位取反
    //00000000000000000000000000000000
    //11111111111111111111111111111111  补码
    //11111111111111111111111111111110  反码
    //10000000000000000000000000000001  原码
    //-1
    printf("%d\n", ~a);
    a = 11;
    a = a | (1 << 2);
    printf("%d\n", a);      //15
    a = a & (~(1 << 2));
    printf("%d\n", a);      //11
    printf("------------------------------------------------------------\n");
    a = 10;
    int b = 10;
    printf("%d\n", ++a);        //前置++，先++，后使用
    printf("%d\n", b++);        //后置++，先使用，再++
    printf("------------------------------------------------------------\n");
    int c = (int)3.14;          //强制类型转换
    printf("%d\n", c);
    printf("------------------------------------------------------------\n");
    int arr[10] = {0};
    char ch[10] = {0};
    printf("%d\n", sizeof(arr));    //40
    printf("%d\n", sizeof(ch));     //10
    test1(arr);                     //8
    test2(ch);                      //8
    printf("------------------------------------------------------------\n");
    a = 0, b = 5;
    c = a && b;             //都为真，结果为真；有一个是假，结果就是假
    printf("%d\n", c);
    c = a || b;             //有一个为真，结果为真；都为假，结果为假
    printf("%d\n", c);
    printf("------------------------------------------------------------\n");
    int i = 0, d = 4;
    a = 0, b = 2, c = 3;
    i = a++ && ++b && d++;      //&&的前面是0，后面就不进去
    //i = a++ || ++b || d++;    //||的前面是!0，后面就不进去
    printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
    return 0;
}

test1(int arr[])
{
    printf("%d\n", sizeof(arr));
}

test2(char ch[])
{
    printf("%d\n", sizeof(ch));
}